# Penanganan data tabular

## Penanganan data csv

In [1]:
getwd() # tahu di mana posisi kita saat ini

[1] "/home/ronggolawe/coding_repo/tutorialStatdasR/notebooks"

In [2]:
setwd("/home/ronggolawe/coding_repo/tutorialStatdasR/notebooks") # mengatur posisi kita

In [3]:
getwd()

[1] "/home/ronggolawe/coding_repo/tutorialStatdasR/notebooks"

In [4]:
# Membaca csv
data <- read.csv("../data/gaji.csv")
data

  ID NAMA       Gaji     Jurusan
1 1  Petrus      1000000 Teologi
2 2  Matius      2000000 Filsafat
3 3  Markus      5000000 Meteorologi
4 4  Barnabas   10000000 Teknik Informatika
5 5  Thomas     20000000 Sistem Informasi
6 6  Ignatius     500000 Pendidikan Agama
7 7  Aisyah     25000000 Teknik Elektro
8 8  Supriyanto  1500000 Ilmu Perpustakaan

In [5]:
# menuliskan csv
head(mtcars)

                  mpg  cyl disp hp  drat wt    qsec  vs am gear carb
Mazda RX4         21.0 6   160  110 3.90 2.620 16.46 0  1  4    4
Mazda RX4 Wag     21.0 6   160  110 3.90 2.875 17.02 0  1  4    4
Datsun 710        22.8 4   108   93 3.85 2.320 18.61 1  1  4    1
Hornet 4 Drive    21.4 6   258  110 3.08 3.215 19.44 1  0  3    1
Hornet Sportabout 18.7 8   360  175 3.15 3.440 17.02 0  0  3    2
Valiant           18.1 6   225  105 2.76 3.460 20.22 1  0  3    1

In [6]:
write.csv(mtcars, file = "../data/tes.csv")

In [7]:
class(data)

[1] "data.frame"

In [8]:
# menuliskan csv dari data frame
c1 <- c(10,20,30,40,50)
c2 <- c('A', 'B', 'C', 'D', 'E')
df <- data.frame(c1,c2)
df

  c1 c2
1 10 A
2 20 B
3 30 C
4 40 D
5 50 E

In [9]:
write.csv(df, file = '../data/tes2.csv')

In [10]:
# Untuk mengetahui secara lebih lanjut, perintahkan:
# help(read.csv)

## Penanganan data excel

In [11]:
library(readxl) # memuat pustaka readxl

In [12]:
excel_sheets("../data/contoh.xlsx")

[1] "Sheet1" "Sheet2"

In [13]:
# membaca file excel
df <- read_excel("../data/contoh.xlsx", sheet = "Sheet1")
df

  No Nama Depan Nama Belakang Jenis Kelamin Negara          Usia ID
1 1  Fernando   Sanchez       Pria          Meksiko         28   1562
2 2  Sandy      Herho         Pria          Indonesia       27   1582
3 3  Mara       Hashimoto     Wanita        Jepang          25   2587
4 4  Philip     Gent          Pria          Belgia          32   2468
5 5  Satya      Narendra      Pria          India           42   6548
6 6  Vincenza   Welland       Wanita        Amerika Serikat 40   3598
7 7  Rudy       Salim         Pria          Indonesia       65   7865
8 8  Gaston     Brumm         Pria          Amerika Serikat 24   2456
9 9  Etta       Hurn          Wanita        Britania Raya   34   1785

In [14]:
summary(df)

       No     Nama Depan        Nama Belakang      Jenis Kelamin
 Min.   :1   Length:9           Length:9           Length:9
 1st Qu.:3   Class :character   Class :character   Class :character
 Median :5   Mode  :character   Mode  :character   Mode  :character
 Mean   :5
 3rd Qu.:7
 Max.   :9
    Negara               Usia             ID
 Length:9           Min.   :24.00   Min.   :1562
 Class :character   1st Qu.:27.00   1st Qu.:1785
 Mode  :character   Median :32.00   Median :2468
                    Mean   :35.22   Mean   :3383
                    3rd Qu.:40.00   3rd Qu.:3598
                    Max.   :65.00   Max.   :7865

In [15]:
str(df)

tibble [9 × 7] (S3: tbl_df/tbl/data.frame)
 $ No           : num [1:9] 1 2 3 4 5 6 7 8 9
 $ Nama Depan   : chr [1:9] "Fernando" "Sandy" "Mara" "Philip" ...
 $ Nama Belakang: chr [1:9] "Sanchez" "Herho" "Hashimoto" "Gent" ...
 $ Jenis Kelamin: chr [1:9] "Pria" "Pria" "Wanita" "Pria" ...
 $ Negara       : chr [1:9] "Meksiko" "Indonesia" "Jepang" "Belgia" ...
 $ Usia         : num [1:9] 28 27 25 32 42 40 65 24 34
 $ ID           : num [1:9] 1562 1582 2587 2468 6548 ...

In [16]:
mean(df$Usia)

[1] 35.22222

In [17]:
df1 <- read_excel("../data/contoh.xlsx", sheet='Sheet2')
df1

  Bilangan Kuadrat
1 1         1
2 2         4
3 3         9
4 4        16
5 5        25

In [18]:
# menulis file excel
library(writexl)

In [19]:
c1 <- c(1:5)
c2 <- 6:10
df2 <- data.frame(c1,c2)
df2

  c1 c2
1 1   6
2 2   7
3 3   8
4 4   9
5 5  10

In [20]:
write_xlsx(df2, "../data/tes.xlsx")